import 'package:animated_list_item/animated_list_item.dart';
import 'package:flutter/material.dart';
import 'package:islamicapp/model/data.doaa.dart';
import 'package:islamicapp/widgets/header.widget.dart';
import 'package:islamicapp/widgets/roqua.widget.dart';
import 'package:islamicapp/widgets/toggle.widget.dart';

import '../widgets/doaa.widget.dart';
class AdayaPage extends StatefulWidget {
  const AdayaPage({super.key});

  @override
  State<AdayaPage> createState() => _AdayaPageState();
}

class _AdayaPageState extends State<AdayaPage> with SingleTickerProviderStateMixin {
  late AnimationController _animationController;
 bool  _showSecondWidget=false;

  @override
  void initState() {
    super.initState();
    _animationController = AnimationController(
      duration: const Duration(milliseconds: 3000),
      vsync: this,
    );
    _animationController.forward();
  }
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
        title: const Align(
        alignment: Alignment.centerRight,
        child: Text(
        "أدعية و أذكار",
        textDirection: TextDirection.rtl,
    )),
    ),
    body: SafeArea(
    child: CustomScrollView(
    slivers: [

    SliverList(
    delegate: SliverChildBuilderDelegate(
        (context, index) {
          if (index == 0) {
            // Your tile with play/pause button and text
            return

              Column(
                children: [

                  ToggoleWidget(textHeader: "دعاء السفر",
                      textDoaa: "اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، ﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾ ((اللَّهُمَّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَليفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ))، وإذا رَجَعَ قَالَهُنَّ وَزَادَ فِيهِنَّ: ((آيِبُونَ، تائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ)))"),
                  ToggoleWidget(textHeader: "ذكر الرجوع من السفر",
                      textDoaa: "((يُكَبِّرُ عَلَى كُلِّ شَرَفٍ ثَلاَثَ تَكْبِيرَاتٍ ثُمَّ يَقُولُ: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزابَ وَحْدَهُ))."),
                  ToggoleWidget(textHeader: "الاستغفار و التوبة",
                      textDoaa: "أستغفر الله العظيم الذي لا إله إلّا هو الحي القيوم وأتوب إليه توبة عبدٍ ظالمٍ لا يملك لنفسه ضراً ولا نفعاً ولا موتاً ولا حياةً ولا نشورا\n\nاللَّهُمَّ أنْتَ رَبِّي لا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وأنا عَبْدُكَ، وأنا علَى عَهْدِكَ ووَعْدِكَ ما اسْتَطَعْتُ، أعُوذُ بكَ مِن شَرِّ ما صَنَعْتُ، أبُوءُ لكَ بنِعْمَتِكَ عَلَيَّ، وأَبُوءُ لكَ بذَنْبِي فاغْفِرْ لِي، فإنَّه لا يَغْفِرُ الذُّنُوبَ إلَّا أنْت \n\n اللَّهُمَّ اغْفِرْ لي خَطِيئَتي وَجَهْلِي، وإسْرَافِي في أَمْرِي، وَما أَنْتَ أَعْلَمُ به مِنِّي، اللَّهُمَّ اغْفِرْ لي جِدِّي وَهَزْلِي، وَخَطَئِي وَعَمْدِي، وَكُلُّ ذلكَ عِندِي، اللَّهُمَّ اغْفِرْ لي ما قَدَّمْتُ وَما أَخَّرْتُ، وَما أَسْرَرْتُ وَما أَعْلَنْتُ، وَما أَنْتَ أَعْلَمُ به مِنِّي، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ، وَأَنْتَ علَى كُلِّ شيءٍ قَدِير"),
                  ToggoleWidget(textHeader: "أدعية الشفاء",
                      textDoaa: " وقد أرشدنا النبي صلى الله عليه وسلم إلى قراءة المعوذتين والفاتحة على المريض، وإن كان القرآن كله شفاء. كما قال الله عز وجل: وَنُنَزِّلُ مِنَ الْقُرْآنِ مَا هُوَ شِفَاءٌ [الإسراء:82].\n\n قوله صلى الله عليه وسلم: أذْهِبِ البَاسَ رَبَّ النَّاسِ، واشْفِ أنْتَ الشَّافِي، لا شِفَاءَ إلَّا شِفَاؤُكَ، شِفَاءً لا يُغَادِرُ سَقَمًا. رواه البخاري ومسلم.\n\nأنَّهُ شَكَا إلى رَسولِ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ وَجَعًا يَجِدُهُ في جَسَدِهِ مُنْذُ أَسْلَمَ، فَقالَ له رَسولُ اللهِ صَلَّى اللَّهُ عليه وسلَّمَ: ضَعْ يَدَكَ علَى الَّذي تَأَلَّمَ مِن جَسَدِكَ، وَقُلْ: باسْمِ اللهِ، ثَلَاثًا، وَقُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ باللَّهِ وَقُدْرَتِهِ مِن شَرِّ ما أَجِدُ وَأُحَاذِرُ.\n\nما رواه أبو داود عن أبي الدرداء قال: سمعت رسول الله صلى الله عليه وسلم يقول : من اشتَكَى منكم شيئًا أو اشتَكاهُ أخٌ لَه فليقُل ربَّنا اللَّهُ الَّذي في السَّماءِ تقدَّسَ اسمُكَ أمرُكَ في السَّماءِ والأرضِ كما رحمتُكَ في السَّماءِ فاجعَل رحمتَكَ في الأرضِ اغفِر لَنا حوبَنا وخطايانا أنتَ ربُّ الطَّيِّبينَ أنزِلْ رحمةً من رحمتِكَ وشفاءً من شفائِكَ علَى هذا الوجَعِ فيبرأ. "),
                  ToggoleWidget(
                      textHeader: "دعاء لَيْلَةِ النِّصْفِ مِنْ شَهْرِ شَعْبَانَ ",
                      textDoaa: "«اللَّهُمَّ يَا ذَا الْمَنِّ وَلَا يُمَنُّ عَلَيْهِ، يَا ذَا الْجَلَالِ وَالإِكْرَامِ، يَا ذَا الطَّوْلِ وَالإِنْعَامِ، لَا إِلَهَ إِلَّا أَنْتَ ظَهْرَ اللَّاجِئينَ، وَجَارَ الْمُسْتَجِيرِينَ، وَأَمَانَ الْخَائِفِينَ، اللَّهُمَّ إِنْ كُنْتَ كَتَبْتَنِي عِنْدَكَ فِي أُمِّ الْكِتَابِ شَقِيًّا أَوْ مَحْرُومًا أَوْ مَطْرُودًا أَوْ مُقَتَّرًا عَلَيَّ فِي الرِّزْقِ، فَامْحُ اللَّهُمَّ بِفَضْلِكَ شَقَاوَتِي وَحِرْمَانِي وَطَرْدِي وَإِقْتَارَ رِزْقِي، وَأَثْبِتْنِي عِنْدَكَ فِي أُمِّ الْكِتَابِ سَعِيدًا مَرْزُوقًا مُوَفَّقًا لِلْخَيْرَاتِ، فَإِنَّكَ قُلْتَ وَقَوْلُكَ الْحَقُّ فِي كِتَابِكَ الْمُنَزَّلِ عَلَى لِسَانِ نَبِيِّكَ الْمُرْسَلِ: ﴿يَمْحُو اللهُ مَا يَشَاءُ وَيُثْبِتُ وَعِنْدَهُ أُمُّ الْكِتَابِ﴾، إِلهِي بِالتَّجَلِّي الْأَعْظَمِ فِي لَيْلَةِ النِّصْفِ مِنْ شَهْرِ شَعْبَانَ الْمُكَرَّمِ، الَّتِي يُفْرَقُ فِيهَا كُلُّ أَمْرٍ حَكِيمٍ وَيُبْرَمُ، أَنْ تَكْشِفَ عَنَّا مِنَ الْبَلَاءِ مَا نَعْلَمُ وَمَا لَا نَعْلَمُ وَمَا أَنْتَ بِهِ أَعْلَمُ، إِنَّكَ أَنْتَ الْأَعَزُّ الْأَكْرَمُ. وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ».\n\nاللهم إني أسألك فهم النبيين، وحفظ المرسلين والملائكة المقربين، اللهم اجعل ألسنتنا عامرة بذكرك، وقلوبنا بخشيتك، وأسرارنا بطاعتك، إنك على كل شيء قدير، حسبنا الله ونعم الوكيل.\n\nاللهمَّ اجعَل لنا في هذا اليوم دعوةً لا‌ تُرَد، وافتح لنا بابًا في الجنّةِ لا‌ يُسَد، واحشرنا في زمرةِ سيدنا محمد صلى الله عليهِ وسلم.\n\nاللهم لا تدع لي ذنبا إلا غفرته، ولا هما إلا فرجته ولا حاجة هي لك رضا إلا قضيتها يا أرحم الراحمين.\n\nاللهم لا تدع لنا يا ربنا في هذه الليلة العظيمة ذنبا إلا غفرته، ولا مريضا إلا شفيته، ولا ميتا إلا رحمته، ولا دعاءً إلا إستجبته، ولا تائباً إلا قبلته، ولا عاريا إلا كسوته، ولا فقيرا إلا أغنيته، ولا مؤمنا إلا ثبته، ولا مؤمنا إلا ثبته، ولا مؤمنا إلا ثبته، ولا طالبا إلا وفقته، ولا عاصيا إلا هديته، ولا مظلوما إلا نصرته، ولا عدوا إلا أخذته، ولا عدوا إلا أهلكته، ولا حاجة من حوائج الدنيا والآخرة هي لك فيها رضا ولنا فيها صلاحُ إلا قضيتها ويسرتها برحمتك يا أرحم الراحمين، يا أرحم الراحمين، يا أرحم الراحمين.\n\nاللهم لا تصرفني من هذه الليلة إلا بذنب مغفور، وسعي مشكور، وعمل متقبل مبرور، وتجارة لن تبور، وشفاء لما فى الصدور، وتوبة خالصة لوجهك الكريم.\n"
                          "اللهم اجعلنى وأهلي وذريتي والمسلمين جميعا فيها من عتقائك من جهنم وطلقائك من النار.\nاللهم اجعلنى فى هذه الليلة ممن نظرت إليه فرحمته وسمعت دعاءه فأجبته."),
                  ToggoleWidget(textHeader: "دعاء ليلة القدر",
                      textDoaa: "أخرج الترمذي في سننه أنَّ عائشة -رضي الله عنها- قالت: (قلتُ: يا رسولَ الله، أرأيتَ إنْ علمتُ أيَّ ليلةٍ ليلة القدْر، ما أقول فيها؟ قال: قولي: اللَّهُمَّ إنَّك عفُوٌّ تحبُّ العفوَ، فاعفُ عنِّي)،\n\nاللهم اهدني فيمن هديت، وعافني فيمن عافيت، وتولني فيمن توليت، وبارك لي فيما أعطيت، وقني شر ما قضيت، إنك تقضي ولا يقضى عليك، إنه لا يذل من واليت، ولا يعز من عاديت، تباركت ربنا وتعاليت).[رواه أبي داود، في سنن أبي داود، عن للحسن بن علي ، الصفحة أو الرقم:1425، إسناده صحيح.].\n\nرَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ\nرَبَّنَا آتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا. \nرَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنْتَ خَيْرُ الرَّاحِمِينَ .\nرَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\nرَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِين .َ\n"
                          "\n. اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيرًا، ولَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ، فَاغْفِرْ لي مَغْفِرَةً مِن عِندِكَ، وارْحَمْنِي، إنَّكَ أنْتَ الغَفُورُالرَّحِيمُ"
                          "\n\n. اللَّهمَّ أنتَ ربِّي لا إلَهَ إلا أنتَ خلَقتني وأنا عبدُكَ وأنا على عَهدِكَ ووعدِكَ ما استطعتُ أعوذُ بِكَ من شرِّ ما صنعتُ أبوءُ لَكَ بنعمتِكَ عليَّ وأبوءُ بذنبي فاغفر لي فإنَّهُ لا يغفرُ الذُّنوبَ إلا أنتَ"
                          "\n\n. اللهم إنا نسألك الثبات في الأمر والعزيمة على الرشد، ونسألك موجبات رحمتك وعزائم مغفرتك، ونسألك شكر نعمتك وحسن عبادتك "
                          "\n\n. اللّهم اغفر لنا ولآبائنا، وأمهاتنا، وأزواجنا، وأبنائنا، وذرِّياتنا، ولإخواننا، وأخواتنا، وذوي أرحامنا، ومن أحبنا فيك ومن أحببناه فيك، ومن أوصانا بالدّعاء ومن أوصيناه بالدّعاء، من كان منهم ميتاً ومن كان منهم حيّاً برحمتك يا أرحم الراحمين"
                          "\n\n. اللهم اجعل في قَلْبي نورًا، وفي بَصَري نورًا، وفي سَمْعي نورًا، وعن يَميني نورًا، وعن شِمالي نورًا، وفَوْقي نورًا، وتَحْتي نورًا، وأمامي نورًا، وخَلْفي نورًا، واجعَلْ لي يومِ لقائِكَ نورًا"
                          "\n\n. اللهم افتح لي أبواب فضلك، وأنزِلْ عليَّ بركاتك، ووفِّقني لموجبات مرضاتك، وأسكنِّي بحبوحات جناتك، يا مجيب دعوة المضطرين"
                          "\n\n. اللهمّ إنّه أصبح في صوتي دعاء وفي قلبي أمنية اللهمّ يسّره وسخّره لي وأسعدني وبشّرني يا خير المبشّرين"
                          "\n\n .اللهم إنّي أسألك بأسمائك الحسنى يا حي يا قيوم، أن تبارك لي في أبنائي وذرّيتي، ولا تضرّهم وأن توفّقهم لطاعتك، اللهم هب لأولاد المسلمين مثل ما سألتك لأولادي يا ذا الجلال والإكرام، اللهم اجعل القرآن العظيم ربيع قلوبهم، وشفاءً لصدورهم، ونورًا لأبصارهم، اللهم فرّح بهم نبيك المختار، واهدهم لما تحبّه وترضاه، واجعلهم ممن تواضع لك"
                          "\n\n اللهُمَّ إِلَيْكَ أَشْكُو ضَعْفَ قُوَّتِي، وَقِلَّةَ حِيلَتِي، وَهَوَانِي عَلَى النَّاسِ، يا أَرْحَمَ الرَّاحِمِينَ إِلَى مَنْ تَكِلُنِي؟ إِلَى عَدُوٍّ يَتَجَهَّمُنِي، أَمْ إِلَى قَرِيبٍ مَلَّكْتَهُ أَمْرِي، إِنْ لَمْ تَكُنْ ساخطا عَلَيَّ فَلَا أُبَالِي، غير أنَّ عَافِيَتَكَ أَوْسَعُ لِي، أَعُوذُ بِنُورِ وَجْهِكَ الكريم الَّذِي أضاءت له السموات والأرض، وأَشْرَقَتْ لَهُ الظُّلُمَاتُ، وَصَلَحَ عَلَيْهِ أَمَرُ الدُّنْيَا وَالْآخِرَةِ أَنْ تُحِلَّ علي غَضَبَكَ، أَوْ تُنْزِلَ عَلَيَّ سَخَطَكَ، لَكَ الْعُتْبَى حَتَّى تَرْضَى، ولا حول ولَا قُوَّةَ إِلَّا بِكَ"
                  ),
                  InkWell(
                      onTap: () {
                        Navigator.push(
                          context,
                          MaterialPageRoute(
                              builder: (_) => RoquaWidget()),
                        );
                      },
                      child: HeaderWidget(text: "الرقية الشرعية")),

                  InkWell(
                      onTap: () {
                        setState(() {
                          _showSecondWidget = !_showSecondWidget;
                        });
                      },
                      child: HeaderWidget(text: "أدعية للحجيج")),


                ],
              );
          }


          /* InkWell(
        onTap: (){
      setState(() {
        _showSecondWidget = !_showSecondWidget;
      });
    },
        child: HeaderWidget(text: "دعاء السفر"),
    ),
    Visibility(
    visible: _showSecondWidget,
    child:DoaaWidget(text: "اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، ﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾ ((اللَّهُمَّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَليفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ))، وإذا رَجَعَ قَالَهُنَّ وَزَادَ فِيهِنَّ: ((آيِبُونَ، تائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ)). "),
    ),


           InkWell(

               onTap: (){
                 setState(() {
                   _showSecondWidget = !_showSecondWidget;
                 });
               },
               child: HeaderWidget(text: "ذكر الرجوع من السفر")),
      Visibility(
        visible: _showSecondWidget,
        child:DoaaWidget(text:"((يُكَبِّرُ عَلَى كُلِّ شَرَفٍ ثَلاَثَ تَكْبِيرَاتٍ ثُمَّ يَقُولُ: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزابَ وَحْدَهُ))."),
      ),*/

          return Visibility(
            visible: _showSecondWidget,
            child: /*SizedBox(
              //height: 650,
              height: MediaQuery
                  .of(context)
                  .size
                  .height * .65,
              child: ListView.builder(
                  itemCount: dataDoaa.length,
                  itemBuilder: (context, index) {
                    return*/ AnimatedListItem(
                      index: index,
                      length: dataDoaa.length,
                      aniController: _animationController,
                      animationType: AnimationType.rotate,
                      child:

                      DoaaWidget(text: dataDoaa[index].text1),

                    ),

                 // ),

           // ),
          );

        },
      childCount: dataDoaa.length,
        )



    )
   ] )
    ));
  }
}
