import 'doaa.model.dart';

List<DoaaData>dataDoaa=[

  DoaaData(text1: "اللَّهُمَّ لَكَ الحَمْدُ حَمْداً يُوَافِي نعمك، ويكافئ مَزِيدَكَ، أحْمَدُكَ بِجَمِيعِ مَحَامِدِكَ ما عَلِمْتُ مِنْهَا وَمَا لَمْ أَعْلَمْ على جَمِيعِ نِعَمِكَ ما عَلِمْتُ مِنْها وَمَا لَمْ أَعْلَمْ، وَعَلى كُلّ حالٍ، اللَّهُمَّ صَلِّ وَسَلِّمْ على مُحَمََّدٍ وَعَلى آلِ مُحَمَّدٍ، اللَّهُمَّ أعِذنِي مِنَ الشَّيْطانِ الرَّجِيمِ، وأَعِذْني مِنْ كُلِّ سُوءٍ، وَقَنِّعْنِي بِمَا رَزَقْتَنِي وَبَارِكْ لِي فِيهِ، اللَّهُمَّ اجْعَلْنِي مِنْ أَكْرَمِ وَفْدِكَ عَلَيْكَ، وألْزِمْنِي سَبِيلَ الاسْتِقَامَةِ حتَّى ألْقاكَ يا رب العالمين، ثم يدعو بما أحب."),

 DoaaData(text1: "يا رَبّ أتَيْتُكَ مِنْ شُقَّةٍ بَعِيدَةٍ مُؤَمِّلاً مَعْرُوفَكَ فَأنِلْنِي مَعْرُوفاً مِنْ مَعْرُوفِكَ تُغْنِينِي بِهِ عَنْ مَعْرُوفِ مَنْ سِوَاكَ يا مَعْرُوفاً بالمَعْرُوفِ."),
  DoaaData(text1: "اللَّهُمَّ ارفع عنا ثقل ذنوبنا، واغفر لنا، وافتح لنا أبواب فضلك ورحمتك، وارحمنا واعطنا وارفعنا من موقف الذل إلى موقف العز."),
      DoaaData(text1: "اللهم ارض عنا وارض عن والدينا، وأمهاتنا رضا تحل به جوامع فضلك وإحسانك وكرمك، اللهم عاملنا بما أنت أهله ولا تعاملنا بما نحن أهله، وأعطنا فوق آمالنا التي نطلبها واجعل المطالب عالية، واجعلنا في الدرجات العالية."),
  DoaaData(text1: "اللهم ارفع ذكرنا فيمن رفعت ذكره، وقدْرنا فيمن رفعت قدره، واشرح صدورنا بما شرحت به صدر نبيك، شرحا نطمئن به إلى عبادتك."),
  DoaaData(text1: "اللهم لا تحرمنا خير ما عندك لشر ما عندنا، اللهم اشف قلوبنا من الأمراض، وألسنتنا من الغي، ونفوسنا من الحسد، واجعلنا قائمين بالحق."),
  DoaaData(text1:"اللهم اعصمنا بدينك وطواعيتك وطواعية رسولِك صلى الله عليه وسلم، وجنبنا حدودك، اللَّهُمَّ اجْعَلْنا نُحِبُّكَ ونُحِبُّ مَلائِكَتَكَ وأنْبِياءَكَ وَرُسُلَكَ، وَنُحِبُّ عِبادَكَ الصَّالِحِينَ، اللَّهُمَّ حَبِّبْنا إلَيْكَ وَإلى مَلائِكَتِكَ وإلَى أنْبِيائِكَ وَرُسُلِكَ، وإلى عِبادِكَ الصَّالِحِينَ، اللَّهُمَّ يَسِّرْنا لليُسْرَى، وَجَنِّبْنا العُسْرَى، واغْفِرْ لَنا في الآخِرَةِ والأولى، وَاجْعَلْنا مِنْ أئمَّةِ المُتَّقِين"),
  DoaaData(text1: "اللَّهُمَّ يا مُقَلِّبَ القُلُوبِ ثَبِّت قَلْبي على دِينكَ."),
  DoaaData(text1: "اللَّهُمَّ إني أسألُكَ مُوجِباتِ رَحْمَتِكَ، وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلامَةَ مِنْ كُلِّ إثْمٍ، وَالفَوْزَ بالجَنَّةِ، وَالنَّجاةَ مِنَ النَّارِ."),
  DoaaData(text1: "اللَّهُمَّ إني أسألُكَ مِنَ الخَيْرِ كُلِّهِ ما عَلِمْتُ مِنْهُ وَما لَمْ أعْلَمُ، وأعُوذُ بِكَ مِنَ الشَّرّ كُلِّهِ ما عَلِمْتُ مِنْهُ وَمَا لَمْ أعْلَمْ، وأسألُكَ الجَنَّةَ وَما قَرّبَ إِلَيْها مِنْ قَوْلٍ أوْ عَمَلٍ، وأعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إلَيْها مِنْ قَوْلٍ أوْ عَمَلٍ."),
  DoaaData(text1: "اللهم كن لنا ولا تكن علينا واختم بالسعادة آجالنا، وحقق بالزيادة أعمالنا واقرن بالعافية غدونا وآصالنا واجعل إلى رحمتك مصيرنا ومآلنا، واصبب سجال عفوك على ذنوبنا، ومنَّ علينا بإصلاح عيوبنا، واجعل التقوى زادنا وفي دينك اجتهادنا، وعليك توكلنا واعتمادنا، وإلى رضوانك معادنا."),
  DoaaData(text1: "اللهم إني أَسْأَلُكَ الرِّضَا بَعَدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأْلُكَ لَذَّةَ النَّظَرِ إلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ، فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلاَ فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ.")
];