import 'omara.data.model.dart';

List<OmaraData>dataOmara =[
  OmaraData(  "أولها:", text2: "الغسل؛", text3:"فيسن الغسل قبل الإحرام لمن أراد العمرة، فإن لم يستطع الغسل فيجزئه الوضوء، ويستوي في ذلك الرجال والنساء"),
  OmaraData( "ثانيها:", text2:"صلاة ركعتين؛ أي: يسن للمعتمر صلاة ركعتين بعد الغسل وقبل الإحرام،", text3:"ويستحب أن يقرأ في الركعة الأولى سورة الكافرون، وفي الثانية سورة  الإخلاص ، ويجزئ عنهما الفرض أو نافلة أخرى؛"),
  OmaraData(  "ثالثها:", text2:"فإن فرغ من الصلاة احرم وقال: ", text3: "لبيك عمرة- لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ"),
  OmaraData(  "رابعها:", text2: " إذا دخل المسجد قدم رجله اليمني قائلا: ", text3: " بِسْمِ اللهِ والسلامُ على رسولِ اللهِ ،أعوذُ بالله العظيمِ ، وبوجهه الكريمِ ، وسلطانِه القديمِ ، من الشيطانِ الرجيمِ،اللهم اغفِرْ لي ذنوبي وافتحْ لي أبوابَ رحمتِك"),
  OmaraData("خامسها", text2: "عند مشاهدة الكعبة،", text3: "يتوقف عن التلبية ويتوجه نحو الحجر الاسود ويبدأ الطواف من عنده،والسنة ان يقوم بالاضطباع اي  كشف الكتف الأيمن أثناء الطواف حول الكعبة،يغطي كتفه الايسر. "),
  OmaraData(  "سادسها", text2: "يبتدئ المعتمر الطواف من الحجر الأسود، ويكون البيت الحرام عن يساره ، يستقبله استقبالا ويقبله إن أمكن  ، ويطوف سبعة أشواط ،ويشير إليه قائلا:", text3: "بسم الله، والله أكبر، اللهم إيماناً بك، وتصديقاً بكتابك، ووفاء بعهدك، واتباعاً لسنة نبيك محمد ـ صلى الله عليه وسلم "),
  OmaraData( "سابعها:", text2: "وإذا بلغ الركن اليماني استلمه من غير تقبيل، فإذا لم يتيسر له لا يزاحم عليه ولا يشير إليه، ويقول بينه وبين الحجر الأسود", text3: "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ"),
  OmaraData( "ثامنها", text2: "وبعد الانتهاء من الطواف، يتقدم نحو مقام إبراهيم ويقرأ", text3: "وَاتَّخِذُوا مِن مَّقَامِ إِبْرَاهِيمَ مُصَلًّى ۖ ،ثم يصلي خلفه ركعتين ويقرأ سورتي الكافرون و الإخلاص بعد الفاتحة، وإن لم يتيسر ففي أي مكان بالمسجد الحرام."),
 // OmaraData(text1: text1, text2: text2, text3: text3)
];